package com.birdbug.common;

import java.util.HashMap;
import java.util.Map;

/**
* @author   作者 E-mail:pjm0008@163.com
* @date 2016年8月29日 下午10:29:59
* @version 1.0
* AirportInfo - com.birdbug.common
**/
public class ImageMap {

	private static Map<String,String> img = new HashMap<String,String>();
	static {
		img.put("澳洲航空公司", "201401111314321432[1].png");          
		img.put("大韩航空公司", "201401111240284028[1].png");          
		img.put("法国航空公司", "201401111241314131[1].png");          
		img.put("菲律宾菲亚航空公司", "201401091730553055[1].png");    
		img.put("韩国德威航空", "2015041310060565[1].jpg");            
		img.put("韩国真航空公司", "201401091729102910[1].jpg");        
		img.put("荷兰皇家航空公司", "20140111124105415[1].png");       
		img.put("美国达美航空公司", "201401111327592759[1].png");      
		img.put("日本航空公司", "201401091724542454[1].gif");          
		img.put("上海航空公司", "201410111039593959[1].png");          
		img.put("斯里兰卡航空公司", "201401091728282828[1].jpg");      
		img.put("文莱航空公司", "201401091723582358[1].png");          
		img.put("中国东方航空公司", "201410111039353935[1].png");      
		img.put("中华航空有限公司", "201401111242214221[1].png");      
		img.put("阿联酋阿提哈德航空公司", "201401111338503850[1].png");
		img.put("阿联酋航空公司", "20140111130125125[1].png");         
		img.put("澳门航空公司", "20140111130737737[1].png");           
		img.put("北欧航空", "201401111340204020[1].png");              
		img.put("成都航空有限公司", "201401111423522352[1].png");      
		img.put("重庆航空公司", "201401111327302730[1].png");          
		img.put("德国汉莎航空公司", "201401111328352835[1].png");      
		img.put("俄罗斯航空公司", "201401111320212021[1].png");        
		img.put("菲律宾东南亚航空", "20140111140249249[1].png");       
		img.put("菲律宾航空公司", "20140111131509159[1].png");         
		img.put("菲律宾速运航空", "201401111342574257[1].png");        
		img.put("芬兰航空公司", "201312170858135813[1].jpg");          
		img.put("港龙航空公司", "20140111130233233[1].png");           
		img.put("国泰航空公司", "201401111315391539[1].png");          
		img.put("海南航空公司", "20140111140832832[1].png");           
		img.put("韩国易斯达航空", "201401111422212221[1].png");        
		img.put("韩亚航空公司", "201401111321242124[1].png");          
		img.put("吉祥航空公司", "2014011114060262[1].png");            
		img.put("加拿大航空", "201401111330243024[1].png");            
		img.put("柬埔寨吴哥航空", "201401111416561656[1].png");        
		img.put("卡塔尔航空公司", "20140111130317317[1].png");         
		img.put("立荣航空", "20140111140944944[1].png");               
		img.put("马来西亚航空公司", "201401111316201620[1].png");      
		img.put("毛里求斯航空", "201409091449334933[1].gif");          
		img.put("美国航空公司", "201401111331313131[1].png");          
		img.put("美国联合航空公司", "20140111130947947[1].png");       
		img.put("美佳环球航空", "201401111348564856[1].png");          
		img.put("墨西哥航空公司", "201401111317181718[1].png");        
		img.put("全日空航空公司", "201401111332243224[1].png");        
		img.put("瑞士国际航空公司", "20140111130355355[1].png");       
		img.put("山东航空公司", "201401111311441144[1].png");          
		img.put("深圳航空公司", "201401111338113811[1].png");          
		img.put("四川航空公司", "201401111227232723[1].png");          
		img.put("宿务太平洋航空", "201401111324292429[1].png");        
		img.put("台湾长荣航空公司", "201401111319301930[1].png");      
		img.put("台湾复兴航空公司", "20140111130156156[1].png");       
		img.put("泰国航空公司", "201401111332573257[1].png");          
		img.put("天津航空", "20140111140758758[1].png");               
		img.put("土耳其航空公司", "20140111130553553[1].png");         
		img.put("维珍航空公司", "201401111318551855[1].png");          
		img.put("厦门航空有限公司", "20140111150424424[1].png");       
		img.put("香港航空公司", "201401111337313731[1].png");          
		img.put("新加坡航空公司", "201401111318151815[1].png");        
		img.put("新西兰航空公司", "201401111326442644[1].png");        
		img.put("亚洲航空（长途）", "20140111140518518[1].png");       
		img.put("伊朗马汉航空", "201401111428422842[1].png");          
		img.put("印度航空公司", "20140111133707377[1].png");           
		img.put("印尼航空", "20140111130648648[1].png");               
		img.put("英国航空公司", "201401111313461346[1].png");          
		img.put("云南祥鹏航空", "201401111349544954[1].png");          
		img.put("中国春秋航空公司", "20140111140633633[1].png");       
		img.put("中国国际航空公司", "20140111130859859[1].png");       
		img.put("中国南方航空公司", "201401111321532153[1].png");      
		img.put("河北航空", "20140111151208128[1].jpg");               
		img.put("西藏航空公司", "201312171052325232[1].jpg");          
		img.put("中国联合航空公司", "201312171051365136[1].jpg");      
	}
	
	public static String getImg(String cmpy) {
		return img.get(cmpy);
	}
}
